vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * This is a slave (gateway) implemented using a ESP8266 which listens to espnow messages from other controllers (masters/sensors) and passes on these messages to MQTT
 * Some points to keep in mind:
 * The gateway connects to an AP (WiFi router) and also listens to espnow messages and this forces the ESP to be on a single channel dictated by the router. Hence the espnow channel is also dictated
 * This means that the masters also have to operate ont he same channel. You can get the channel on the master by scanning the SSID of the router and determining its channel. 
 * Features:
 * - Implements both the WiFi station and ESPNow slave in a single ESP module
 * - Retries MQTT connection a few times before giving up
 * - Publishes initial health message on startup and then a health message at a set interval, stats like msg count, msg rate, queue length, free memory, uptime etc are posted
 * - Supports OTA
 * - DONE - Do not pop out the message form the queue in case posting to MQTT isnt successful
 * 
 * TO DO :
 * - implement encryption, instead of using inbuilt one you can use Chacha for encryption, see this library for details : https://github.com/eccnil/ESPNow2Mqtt
 * - encryption isnt working. Even if I change the keys on the master to random values, the slave is able to receieve the messages, so have to debug later
 *  if you can solve the encryption issue, remove it as with excryption , an eSP8266 can only connect to 6 other peers, ESP32 can connect to 10 other
 *  while without encryption they can connect to 20 peers, encryption eg from :https://github.com/espressif/ESP8266_NONOS_SDK/issues/114#issuecomment-383521100
 * - Change the role to COMBO for both slave and Controller so that Slave can also pass on administration messages to the controller.
 * - construct the controller topic from its mac address instead of picking it up from the message id. Instead use message id as a string to identify the device name
 * - Introduce a status LED for MQTT connection status
 * - Implement a restart of ESP after configurable interval if the connection to MQTT is not restored
 * - To Support COMBO role where it can receive and send messages
 * - Support automatic pairing of peers , see here for ideas : https://randomnerdtutorials.com/esp-now-auto-pairing-esp32-esp8266/
 */

// IMPORTANT : Compile it for the device you want, details of which are in Config.h
/* For now currently turning OFF security as I am not able to make it work. It works even if the keys aren't the same on controller and slave
 * Also I have to find a way to create a list of multiple controllers as with security you haev to register each controller separately
 * See ref code here: https://www.electrosoftcloud.com/en/security-on-your-esp32-with-esp-now/
*/
//#define MQTT_MAX_PACKET_SIZE 2048

#include <Arduino.h>
#ifdef ESP32
  #include <WiFi.h>
  #include <AsyncTCP.h>
#else
  #include <ESP8266WiFi.h>
  #include <ESPAsyncTCP.h>
#endif
#include <ESPAsyncWebServer.h>

#include "Config.h" // defines all Config parameters. set your values before compiling
#include "Debugutils.h" //This file is located in the Sketches\libraries\DebugUtils folder
#include <espnow.h> // provides espnow capabilities for ESP8266
#include "secrets.h" // provides all passwords and sensitive info
#include <ArduinoJson.h> // provides json capabilities for messages published to MQTT
#include <ArduinoQueue.h> // provide Queue management
#include <ArduinoOTA.h> 
#include "espnowMessage.h" // for struct of espnow message
#include <PubSubClient.h> // library for MQTT
#include <Pinger.h> // used for pinging a server (gatewya) in case of connection issues with MQTT
#include "myutils.h" // provides some uitlity functions
#include "espwatchdog.h" // provides capability ot reset the ESP in case it becomes unresponsive
#include "pir_sensor.h" // provides capability to attach a PIR sensor to the ESP
#include <ezLED.h> // provides non blocking blinking of a LED 
// I am using a local copy of this library instead from the std library repo as that has an error in cpp file.
// The author has defined all functions which take a default argumnent again in the cpp file whereas the default argument should only be 
// specified in the decleration and not in the implementation of the function.

// ************ HASH DEFINES *******************
#define VERSION "1.2"
#define MAC_DELIMITER ":" // delimiter with which MAC address is separated
#define OTA_TRIGGER_DURATION 10 // time in secs for which trigger the ESPNOW OTA messages
#define OTA_MSG_INTERVAL  50 //interval in ms at which to repeat OTA messages
const char compile_version[] = VERSION " " __DATE__ " " __TIME__; //note, the 3 strings adjacent to each other become pasted together as one long string
#define KEY_LEN  16 // lenght of PMK & LMK key (fixed at 16 for ESP)
#define MQTT_RETRY_INTERVAL 5000 //MQTT server connection retry interval in milliseconds
#define STATE_TOPIC "/state" // end path of topic to publish state of the messages
#define OTA_TOPIC "/ota" // end path of topic to publish ota messages
#define ERROR_TOPIC "/error" // end path of topic to publish error messages
#define QUEUE_LENGTH 50 // max no of messages the ESP should queue up before replacing them, limited by amount of free memory
#define MAX_MSG_BUFFER_SIZE 512 // max size of the MQTT packet buffer, it includes topic name+payload+header bytes, set your payload max lenn accordingly using MAX_MESSAGE_LEN below 
#define MAX_MESSAGE_LEN 412 // defines max message length of payload message. Included space for 100 bytes for topic name + header
#define HEALTH_INTERVAL 30e3 // interval is millisecs to publish health message for the gateway
#ifndef ESP_OK
  #define ESP_OK 0 // This is defined for ESP32 but not for ESP8266 , so define it
#endif
// API_TIMEOUT is used to determine how long to wait for MQTT connection before restarting the ESP
#ifndef API_TIMEOUT
  #define API_TIMEOUT 600 // define default timeout of monitoring for MQTT connection if not defined.
#endif
#define MAX_MQTT_PUBLISH_FAILURES 5 //max no of times MQTT publishing can fail even though the MQTT client was connected beyond which ESP restart happens
// ************ HASH DEFINES *******************

// ************ GLOBAL OBJECTS/VARIABLES *******************
const char* ssid = WiFi_SSID; // comes from config.h
const char* password = WiFi_SSID_PSWD; // comes from config.h
long last_time = 0; // last time when health check was published
bool retry_message = false; // flag to indicate to retry sending of message in case of failure
long last_message_count = 0;//stores the last count with which message rate was calculated
long message_count = 0;//keeps track of total no of messages publshed since uptime
long lastReconnectAttempt = 0; // Keeps track of the last time an attempt was made to connect to MQTT
short mqtt_publish_fails = 0; //tracks the no of times MQTT publishing has failed even though the MQTT client was connected
bool initilized = false; // flag to track if initialisation of the ESP has finished. At present it only handles tracking of the "init" message published on startup
extern "C"
{ 
  #include <lwip/icmp.h> // needed for icmp packet definitions , not sure what was this?
}
Pinger pinger;
ezLED  statusLED(STATUS_LED);
watchDog MQTT_wd = watchDog(API_TIMEOUT); // monitors the MQTT connection, if it is disconnected beyond API_TIMEOUT , it restarts ESP
//List of controllers(sensors) who will send messages to this receiver
uint8_t controller_mac[][6] = CONTROLLERS; //from secrets.h
/* example entry : 
uint8_t controller_mac[2][6] = {  
   {0x4C, 0xF2, 0x32, 0xF0, 0x74, 0x2D} ,
   {0xC, 0xDD, 0xC2, 0x33, 0x11, 0x98}
}; */
// Define security keys, these are random hex numbers
uint8_t kok[KEY_LEN]= PMK_KEY_STR;//comes from secrets.h
uint8_t key[KEY_LEN] = LMK_KEY_STR;// comes from secrets.h

ArduinoQueue<espnow_message> structQueue(QUEUE_LENGTH);
WiFiClient espClient;
PubSubClient client(espClient);
static espnow_message emptyMessage;
espnow_message currentMessage = emptyMessage;

#if(USING(ESPNOW_OTA_SERVER))
  AsyncWebServer server(80);
  const char* input_param_mac = "input_mac";
#endif


#if USING(MOTION_SENSOR)
pir_sensor motion_sensor(PIR_PIN,MOTION_ON_DURATION);
#endif
// HTML web page to handle web server requests for ESPNOW OTA functionality
const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE HTML><html><head>
  <title>ESPNOW OTA</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <style>
    html {font-family: Times New Roman; display: inline-block; text-align: center;}
    h2 {font-size: 3.0rem; color: #FF0000;}
  </style>
  </head><body>
  <form action="/espnowota">
    Enter the MAC Address: <input type="text" name="input_mac">
    <input type="submit" value="Send OTA Request">
  </form><br>
</body></html>)rawliteral";

#if defined(ESP32)
esp_now_peer_info_t peerInfo; // This object must be a global object else the setting of peer will fail
#endif
#if USING(SECURITY)
uint8_t kok[16]= PMK_KEY_STR;//comes from secrets.h
uint8_t key[16] = LMK_KEY_STR;// comes from secrets.h
#endif

espnow_message myData;
unsigned long start_time;
unsigned long last_msg_sent_time;
espnow_device esp_ota_device;
// ************ GLOBAL OBJECTS/VARIABLES *******************
#include "espnowController.h" //defines all utility functions for sending espnow messages from a controller


