vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * creates data for health message and publishes it
 * takes bool param init , if true then publishes the startup message else publishes the health check message
 */
bool publishHealthMessage(bool init=false)
{
  char publish_topic[65] = "";
  String str_msg="";

  if(init)
  {
     // publish the init message
    StaticJsonDocument<MAX_MESSAGE_LEN> init_msg_json;//It is recommended to create a new obj than reuse the earlier one by ArduinoJson
    init_msg_json["version"] = compile_version;
    init_msg_json["tot_memKB"] = (float)ESP.getFlashChipSize() / 1024.0;
    init_msg_json["mac"] = WiFi.macAddress();
    init_msg_json["macAP"] = WiFi.softAPmacAddress();
    init_msg_json["wifiChannel"] = WiFi.channel();
    strcpy(publish_topic,MQTT_TOPIC);
    strcat(publish_topic,"/init");
    str_msg="";
    serializeJson(init_msg_json,str_msg);
    return publishToMQTT(str_msg.c_str(),publish_topic,true);
  }
  else
  {
    StaticJsonDocument<MAX_MESSAGE_LEN> msg_json;
    msg_json["uptime"] = millis()/1000; //publish uptime in seconds
    msg_json["mem_freeKB"] = serialized(String((float)ESP.getFreeHeap()/ 1024.0,0));//Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/
    msg_json["msg_count"] = message_count;
    msg_json["queue_len"] = structQueue.itemCount();
    float message_rate = (message_count - last_message_count)/(float)(HEALTH_INTERVAL/(60*1000));//rate calculated over one minute
    last_message_count = message_count;//reset the count
    msg_json["msg_rate"] = serialized(String(message_rate,1));//format with 1 decimal places, Ref:https://arduinojson.org/v6/how-to/configure-the-serialization-of-floats/

    // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
    strcpy(publish_topic,MQTT_TOPIC);
    strcat(publish_topic,"/state");
    serializeJson(msg_json,str_msg);
    if(publishToMQTT(str_msg.c_str(),publish_topic,false))
    {
      // publish the wifi message , I am publishing this everytime because it also has rssi
      String strIP_address = WiFi.localIP().toString();
      StaticJsonDocument<MAX_MESSAGE_LEN> wifi_msg_json;//It is recommended to create a new obj than reuse the earlier one by ArduinoJson
      wifi_msg_json["ip_address"] = strIP_address;
      wifi_msg_json["rssi"] = WiFi.RSSI();
      strcpy(publish_topic,MQTT_TOPIC);
      strcat(publish_topic,"/wifi");
      str_msg="";
      serializeJson(wifi_msg_json,str_msg);
      return publishToMQTT(str_msg.c_str(),publish_topic,true);
   }
  }
  return false;//control will never come here
}

void printInitInfo()
{
  DPRINTLN("Starting up as a ESPNow Gateway");
  #if USING(MOTION_SENSOR)
    DPRINTLN("Motion sensor ON");
  #else
    DPRINTLN("Motion sensor OFF");
  #endif
  #if USING(SECURITY)
    DPRINTLN("Security ON");
  #else
    DPRINTLN("Security OFF");
  #endif

}

#if(USING(ESPNOW_OTA_SERVER))
void notFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "Not found");
}

/*
 * Adds ESP MAC as a peer to which OTA messages need to be send and sets the relevant flags. The loop() then takes care of sending the messages to this device
 * param: peerAddress: address of the peer as an uint8 array
 * param: duration : duration in sec for which to keep sending this message
 * param: stop_on_delivery : flag to indicate it it should stop sending messages once it gets the delivery confirmation
 */
void prepare_for_OTA(uint8_t peerAddress[])
{
//  espnow_message myData;
  #if(USING(SECURITY))
    refreshPeer(peerAddress, key,RECEIVER_ROLE);
  #else
    refreshPeer(peerAddress, NULL,RECEIVER_ROLE);
  #endif
  // If devicename is not given then generate one from MAC address stripping off the colon
  #ifdef DEVICE_NAME
    strcpy(myData.device_name,DEVICE_NAME);
  #else
    String wifiMacString = WiFi.macAddress();
    wifiMacString.replace(":","");
    snprintf(myData.device_name, 16, "%s", wifiMacString.c_str());
  #endif
  myData.msg_type = ESPNOW_OTA;
  esp_ota_device.ota_mode = true; // set the ota flag which will trigger the OTA flow in loop()
  esp_ota_device.ota_done = false; // reset the success flag
  start_time = millis(); // start the timer
  //DPRINTLN("Device prepared for sending OTA messages:%02X:%02X:%02X:%02X:%02X:%02X ",peerAddress[0],peerAddress[1],peerAddress[2],peerAddress[3],peerAddress[4],peerAddress[5]);
  DPRINTLN("Device prepared for sending OTA messages");
}

void config_webserver()
{
  // Handles root page
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html);
  });

  // Handles OTA request for an ESPNOW device
  server.on("/espnowota", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String mac_addr , response_msg;
    // OTA can be triggered only for one device at a time, reject this request if one is already in progress
    if(!esp_ota_device.ota_mode)
    {
      if (request->hasParam(input_param_mac)) {
        mac_addr = request->getParam(input_param_mac)->value();
        if(validate_MAC(mac_addr.c_str()))
        {
          DPRINTFLN("MAC %s is valid",mac_addr.c_str());
          mac_addr.replace(MAC_DELIMITER,"");
          MAC_to_array(mac_addr.c_str(),esp_ota_device.mac,6);
          prepare_for_OTA(esp_ota_device.mac);
          response_msg = "ESPNOW OTA req sent to device: ";
        }
        else
        {
          response_msg = "MAC address provided in invalid : ";
          DPRINTFLN("MAC %s is invalid",mac_addr.c_str());
        }
      }
      else 
      {
        mac_addr = "none";
      }
    }
    else
    {
      char buffer[18];
      sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
      response_msg = "OTA already in progress for device: " + String(buffer);
      DPRINTLN(response_msg);
    }
    request->send(200, "text/html", response_msg + mac_addr + " <br><a href=\"/\">Return to Home Page</a>");
  });
  server.onNotFound(notFound);
  server.begin();  
}
#endif


